app/controllers/authentications_controller.rb

  def create
    auth = Authentication.find_or_create_from_omniauth(request.env['omniauth.auth'])
    # This logs the user in, if not logged in already, or sets
    # the user for additional authentications to the user that is
    # logged in.  This allows a user to sign up via twitter, then
    # add a twitter login to the same User record.

    auth.create_or_associate_user(current_user)
---
INSERT INTO `authentications` (`created_at`, `image_url`, `name`, `provider`, `provider_id`, `secret`, `token`, `uid`, `updated_at`, `url`, `user_id`) VALUES ('2012-05-29 00:41:56', NULL, NULL, 'facebook', NULL, NULL, NULL, '698145074', '2012-05-29 00:41:56', NULL, NULL)
INSERT INTO "users" ("created_at", "email", "image_url", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)