app/controllers/documents_controller.rb

SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 1 AND "authentications"."provider" = 'google' LIMIT 1
---
  def load_auth
    unless current_user && @auth = current_user.authentications.first(:conditions => { :provider => 'google' })