app/controllers/users_controller.rb

  def show
    @providers = %w(facebook twitter)
    if current_user
    	@authorized_providers = Authentication.where(:user_id => current_user.id).pluck(:provider)
    end
    @updates = []

    friends = current_user.inverse_friends.map(&:id) + current_user.friends.map(&:id) + [current_user.id]

    @users = User.find(:all, :select=>'username').map(&:username)
---
SELECT provider FROM `authentications` WHERE `authentications`.`user_id` = 2
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`user_id` = 1 AND `authentications`.`provider` IN ('facebook', 'twitter', 'linkedin')
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]